[중복 데이터 처리]

중복 데이터 검사&처리(삭제)

[주의] 항상 중복 데이터 삭제 X (데이터 특성에 따라 필요한 경우가 있기도)

In [2]:
#모듈 로딩
import pandas as pd

In [3]:
#데이터 준비
df=pd.read_csv('data.csv')
df

   no  name   age gender
0   1  Hong  10.0      F
1   2   NaN  13.0      F
2   3   Kim  12.0      M
3   4   Lee  12.0      F
4   5   Lim   NaN      M
5   3   Kim  12.0      M

In [4]:
#데이터 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   no      6 non-null      int64
 1   name    5 non-null      object
 2   age     5 non-null      float64
 3   gender  6 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 320.0+ bytes

In [5]:
#컬럼별 타입과 실제 데이터 확인
df.head(2),df.tail(2)

(   no  name   age gender
 0   1  Hong  10.0      F
 1   2   NaN  13.0      F,
    no name   age gender
 4   5  Lim   NaN      M
 5   3  Kim  12.0      M)

In [6]:
#전처리_결측치

In [7]:
#중복데이터 검사&처리: keep()  <- 어떤 컬럼을 중복 데이터로 취급하지 않을 지 설정(기본값: first)
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [8]:
df.duplicated(keep='last')

0    False
1    False
2     True
3    False
4    False
5    False
dtype: bool

In [9]:
df.duplicated(keep=False)

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [10]:
#중복 데이터 개수 확인: false는 0, true는 1이니까
df.duplicated().sum()

1

In [11]:
#중복 데이터 처리
df.drop_duplicates()

   no  name   age gender
0   1  Hong  10.0      F
1   2   NaN  13.0      F
2   3   Kim  12.0      M
3   4   Lee  12.0      F
4   5   Lim   NaN      M

In [12]:
df.drop_duplicates(keep='last')

   no  name   age gender
0   1  Hong  10.0      F
1   2   NaN  13.0      F
3   4   Lee  12.0      F
4   5   Lim   NaN      M
5   3   Kim  12.0      M

In [13]:
df.drop_duplicates(keep=False)

   no  name   age gender
0   1  Hong  10.0      F
1   2   NaN  13.0      F
3   4   Lee  12.0      F
4   5   Lim   NaN      M

In [14]:
#나이 컬럼만 중복 여부 확인
df.duplicated(subset=['age'])

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool